app/controllers/api/v1/expenses_controller.rb

  def index
    if !params[:query].blank?
      expenses = current_user.expenses.unarchived.searched_by_keyword(params[:query]).order("created_at desc")
---
SELECT `expenses`.* FROM `expenses` WHERE (reason like '%p%' or details like '%p%') ORDER BY created_at desc

  def create
    expense = Expense.create(expense_params)
    render json: current_user.expenses.order("created_at desc")
---
INSERT INTO `expenses` (`price`, `reason`, `details`, `created_at`, `updated_at`, `user_id`) VALUES (2000.0, 'bhishi', 'given to pinku on 10th feb... at sandhya wahini\'s place', '2017-02-16 12:10:05', '2017-02-16 12:10:05', 1)
SELECT `expenses`.* FROM `expenses` WHERE `expenses`.`user_id` = 1 ORDER BY created_at desc

  def destroy
    e = Expense.find(params[:id])
    e.update_attributes({:deleted => true})
---
SELECT  `expenses`.* FROM `expenses` WHERE `expenses`.`id` = 15 LIMIT 1
UPDATE `expenses` SET `deleted` = 1, `updated_at` = '2017-03-01 16:49:34' WHERE `expenses`.`id` = 4