app/controllers/expenses_controller.rb

SELECT `expenses`.* FROM `expenses` WHERE `expenses`.`user_id` = 1 ORDER BY created_at desc
---
  def index
    if params[:previous]
      @expenses = current_user.expenses.unarchived.order("created_at desc")

INSERT INTO `expenses` (`price`, `reason`, `details`, `date`, `created_at`, `updated_at`) VALUES (2000.0, 'chit fund', 'given to pinku', '2017-02-10', '2017-02-16 11:18:42', '2017-02-16 11:18:42')
---
  def create
    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save

SELECT  `expenses`.* FROM `expenses` WHERE `expenses`.`id` = 1 LIMIT 1
---
    def set_expense
      @expense = Expense.find(params[:id])